tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "awscli"
brew "asdf"
brew "eks-node-viewer"
brew "fontforge"
brew "fzf"
brew "ghq"
brew "goenv", args: ["HEAD"]
brew "helm"
brew "helmfile"
brew "jq"
brew "k9s"
brew "kustomize"
brew "rbenv"
brew "terraform"
brew "wrk"

cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "appcleaner"
cask "bettertouchtool"
cask "cloudflare-warp"
cask "docker"
cask "deepl"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "notion"
cask "sequel-pro"
cask "slack"
cask "spotify"
cask "tripmode"
cask "visual-studio-code"
cask "zoom"

if !ENV["CI"]
  mas "Kindle", id: 302584613
  mas "Trello", id: 1278508951
  mas "Unsplash Wallpapers", id: 1284863847
  mas "Reeder 5", id: 1529448980
  mas "Kindle", id: 302584613
end
