tap "aws/tap"

brew "awscli"
brew "asdf"
brew "eks-node-viewer"
brew "fzf"
brew "gh"
brew "ghq"
brew "goenv", args: ["HEAD"]
brew "helm"
brew "helmfile"
brew "jq"
brew "k9s"
brew "kustomize"
brew "rbenv"
brew "wrk"

cask "1password"
cask "1password-cli", greedy: true
cask "alt-tab"
cask "appcleaner"
cask "chatgpt"
cask "cloudflare-warp"
cask "docker"
cask "deepl"
cask "google-chrome"
cask "google-japanese-ime", greedy: true
cask "karabiner-elements"
cask "krisp"
cask "mysqlworkbench"
cask "notion"
cask "pgadmin4"
cask "slack"
cask "spotify"
cask "tripmode"
cask "visual-studio-code"
cask "zoom"

if !ENV["CI"]
  mas "Kindle", id: 302584613
  mas "Trello", id: 1278508951
  mas "Reeder 5", id: 1529448980
end
