tap "homebrew/cask-fonts"

brew "fontforge"
brew "fzf"
brew "ghq"
brew "goenv"
brew "helm"
brew "kubernetes-cli"
brew "kustomize"
brew "nodebrew"
brew "rbenv"

cask "appcleaner"
cask "bettertouchtool"
cask "chatwork"
cask "docker"
cask "deepl"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-japanese-ime"
cask "hyperswitch"
cask "karabiner-elements"
cask "keepassxc"
cask "notion"
cask "sequel-pro"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"

if !ENV["CI"]
  mas "1Password 7", id: 1333542190
  mas "Trello", id: 1278508951
  mas "Unsplash Wallpapers", id: 1284863847
  mas "Wallcat", id: 1000397973
end
